#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

azurerm_resource_group.resourcegroup: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg]
azurerm_user_assigned_identity.aks: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/poc-identity-aks]
azurerm_user_assigned_identity.app_gateway: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/poc-identity-app-gateway]
module.virtual_network.azurerm_virtual_network.base_network: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/virtualNetworks/poc-network]
module.virtual_network.azurerm_subnet.frontend: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/virtualNetworks/poc-network/subnets/frontend-subnet]
module.application_gateway.azurerm_public_ip.ag_public_ip: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/publicIPAddresses/poc-ag-public_ip]
module.application_gateway.azurerm_application_gateway.app_gateway: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/applicationGateways/poc-ag]
module.aks_cluster.data.azurerm_user_assigned_identity.application_gateway: Reading...
module.aks_cluster.azurerm_subnet.kubernetes_node_pool_default: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/virtualNetworks/poc-network/subnets/dev-kubernetes-nodepool-default]
module.aks_cluster.data.azurerm_client_config.current: Reading...
module.aks_cluster.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0yYjVlOGI2MS0wNTc0LTQ1OWItODE5Yy02OTgzZTY0NDQzMTE7b2JqZWN0SWQ9ZWU4MDk0NjgtNWQyMS00YTA1LWJjZDgtMDJmYjJkYzQwYjExO3N1YnNjcmlwdGlvbklkPTliMWVkYWQwLTlhMTMtNGM3YS05MjJhLThkNzljYjE5ZmY4Mzt0ZW5hbnRJZD00YTczYjFiOS03MWExLTRmMGUtODRhMi00ZmRkODI4Y2E3YmM=]
module.aks_cluster.data.azurerm_user_assigned_identity.application_gateway: Read complete after 0s [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/poc-identity-app-gateway]
module.aks_cluster.azurerm_kubernetes_cluster.aks_cluster: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.ContainerService/managedClusters/aks]
module.aks_cluster.data.azurerm_user_assigned_identity.aks_ingress_application_gateway: Reading...
module.aks_cluster.data.azurerm_user_assigned_identity.aks_ingress_application_gateway: Read complete after 0s [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/MC_poc-rg_aks_eastus/providers/Microsoft.ManagedIdentity/userAssignedIdentities/ingressapplicationgateway-aks]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aks_cluster.azurerm_role_assignment.aks_app_gateway_rg_role_assignement_operator will be created
  + resource "azurerm_role_assignment" "aks_app_gateway_rg_role_assignement_operator" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ca1d1b98-32b2-445e-8032-49487532ca3e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Managed Identity Operator"
      + scope                            = "/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/poc-identity-app-gateway"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks_cluster.azurerm_role_assignment.aks_app_gateway_rg_role_assignment_contributor will be created
  + resource "azurerm_role_assignment" "aks_app_gateway_rg_role_assignment_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ca1d1b98-32b2-445e-8032-49487532ca3e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/applicationGateways/poc-ag"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks_cluster.azurerm_role_assignment.aks_app_gateway_rg_role_assignment_reader will be created
  + resource "azurerm_role_assignment" "aks_app_gateway_rg_role_assignment_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ca1d1b98-32b2-445e-8032-49487532ca3e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks_cluster.azurerm_role_assignment.subnet_kubernetes_node_pool_default_role_assignment will be created
  + resource "azurerm_role_assignment" "subnet_kubernetes_node_pool_default_role_assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = "/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/virtualNetworks/poc-network/subnets/dev-kubernetes-nodepool-default"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks_cluster.azurerm_role_assignment.subnet_kubernetes_node_pool_owner_role_assignment will be created
  + resource "azurerm_role_assignment" "subnet_kubernetes_node_pool_owner_role_assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2b5e8b61-0574-459b-819c-6983e6444311"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/virtualNetworks/poc-network/subnets/dev-kubernetes-nodepool-default"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @dtags, Action: `pull_request`*